![Pandas Logo](https://files.realpython.com/media/Pandas-Project-Make-a-Gradebook-With-Pandas_Watermarked.6cf148621988.jpg)

Welcome to my Pandas tutorial notebook! This notebook aims to help you learn Pandas, a powerful tool for working with data in Python. Whether you're new to data analysis or looking to improve your skills, this tutorial will guide you through essential Pandas functions and techniques.

# Table of Contents
- [Introduction to Pandas](#1)
    - [What is Pandas?](#1.1)
    - [Installing Pandas](#1.2)
    - [Importing Pandas](#1.3)
- [Data Structures in Pandas](#2)
    - [DataFrame](#2.1)
        - [Creating a DataFrame](#2.1.1)
        - [DataFrame Attributes and Methods](#2.1.2)
- [Data Indexing and Selection](#3)
    - [Previewing Data](#3.1) 
    - [Selecting Data by Label](#3.2)
    - [Selecting Data by Position](#3.3)
    - [Boolean Indexing](#3.4)
    - [Setting and Resetting Index](#3.5)
- [Data Manipulation](#4)
    - [Adding and Removing Columns](#4.1)
    - [Renaming Columns](#4.2)
    - [Handling Missing Data](#4.3)
        - [Detecting Missing Data](#4.3.1)
        - [Filling Missing Data](#4.3.2)
        - [Dropping Missing Data](#4.3.3)
    - [Handling Duplicates](#4.4)
    - [Replacing Values](#4.5)
    - [Unique Values](#4.6)
    - [Value Counts](#4.7) 
- [Data Operations](#5)
    - [Descriptive Statistics](#5.1)
    - [Applying Functions](#5.2)
    - [Sorting and Ranking](#5.3)
    - [Grouping Data](#5.4)
        - [GroupBy](#5.4.1)
        - [Aggregation](#5.4.2)
        - [Transformation](#5.4.3)
        - [Filtering](#5.4.4)
- [Data Cleaning and Preparation](#6)
    - [Handling Different Data Types](#6.1)
    - [Working with Dates and Times](#6.2)
    - [String Manipulation](#6.3)
- [Combining Data](#7)
    - [Merging DataFrames](#7.1)
        - [Inner Join](#7.1.1)
        - [Outer Join](#7.1.2)
        - [Left Join](#7.1.3)
        - [Right Join](#7.1.4)
    - [Concatenating DataFrames](#7.2)
    - [Append DataFrames](#7.3)
- [Reshaping Data](#8)
    - [Pivot Tables](#8.1)
    - [Melting DataFrames](#8.2)
    - [Cross Tabulation](#8.3)
- [Input and Output Operations](#9)
    - [Reading Data from Various Formats](#9.1)
    - [Writing Data to Various Formats](#9.2)
- [Visualization with Pandas](#10)
    - [Plotting with Pandas](#10.1)
    - [Plotting Different Types of Data](#10.2) 
- [Advanced Topics](#11)
    - [Descriptive Statistics](#11.1)
    - [Applying Functions](#11.2)
    - [Sorting and Ranking](#11.3)
    - [Handling Duplicates](#11.4)
- [Speeding Up Pandas Operations](#12)

## Introduction to Pandas <a id='1'></a>

### What is Pandas? <a id = '1.1'></a>

Pandas is a popular open-source Python library used for data manipulation, analysis, and cleaning. It provides easy-to-use data structures (primarily DataFrame), high-level data manipulation tools, and built-in functions to work with structured data seamlessly.

### Installing Pandas <a id='1.2'></a>

* Installing with Miniconda<br>
`
python main.pyconda create -c conda-forge -n name_of_my_env python panda`
* Installing from PyPI<br>
`pip install pandas`

### Importing Pandas <a id='1.3' ></a>

In [10]:
import pandas as pd

In [11]:
pd.__version__

'2.2.2'

## Data Structures in Pandas <a id='2'></a>

### DataFrame <a id = '2.1'></a>

#### Creating a DataFrame <a id = '2.1.1'></a>

Pandas Create Dataframe Syntax: `pandas.DataFrame(data, index, columns).` <a href="https://www.geeksforgeeks.org/different-ways-to-create-pandas-dataframe/">Click for more information</a>

In [16]:
pd.DataFrame([['tom', 10], ['nick', 15], ['juli', 14]],
             columns=['Name', 'Age'])

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [17]:
pd.DataFrame({'Name': ['Tom', 'nick', 'krish', 'jack'], 
              'Age': [20, 21, 19, 18]})

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [18]:
pd.DataFrame({'one': pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd']),
              'two': pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])})

   one  two
a   10   10
b   20   20
c   30   30
d   40   40

#### DataFrame Attributes and Methods <a id = '2.1.2'></a>

Check `.index, .columns, .values, .dtypes, .shape, .size, .info()` methods

In [21]:
test_df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Boston'],
    'Salary': [50000, 70000, 60000, 80000, 55000]
})

In [22]:
test_df.index

RangeIndex(start=0, stop=5, step=1)

In [23]:
test_df.columns

Index(['Name', 'Age', 'City', 'Salary'], dtype='object')

In [24]:
test_df.values

array([['Alice', 25, 'New York', 50000],
       ['Bob', 30, 'Los Angeles', 70000],
       ['Charlie', 35, 'Chicago', 60000],
       ['David', 28, 'Houston', 80000],
       ['Emily', 32, 'Boston', 55000]], dtype=object)

In [25]:
test_df.dtypes

Name      object
Age        int64
City      object
Salary     int64
dtype: object

In [26]:
test_df.shape

(5, 4)

In [27]:
test_df.size

20

In [28]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
 3   Salary  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

## Data Indexing and Selection <a id='3'></a>

### Previewing Data <a id='3.1'></a>

In [31]:
# to see first 5 rows in a dataset -> default provide 5 variables..
test_df.head()

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   70000
2  Charlie   35      Chicago   60000
3    David   28      Houston   80000
4    Emily   32       Boston   55000

In [32]:
# to see last 2 rows in a dataset -> default provide 5 variables..
test_df.tail(2)

    Name  Age     City  Salary
3  David   28  Houston   80000
4  Emily   32   Boston   55000

In [33]:
# fetch random 5 variables -> default provide 1 variables..
test_df.sample(5)

      Name  Age         City  Salary
1      Bob   30  Los Angeles   70000
0    Alice   25     New York   50000
2  Charlie   35      Chicago   60000
4    Emily   32       Boston   55000
3    David   28      Houston   80000

### Selecting Data by Label <a id='3.2'></a>

<strong>.loc</strong> and also <strong>[]</strong> indexing can select data by label

* Syntax:
    * Series: `s.loc[indexer]`
    * DataFrame: `df.loc[row_indexer,column_indexer]`

In [36]:
# Bring just Name and Age columns with labels
test_df[['Name','Age']]
test_df.loc[:, ['Name','Age']]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28
4    Emily   32

In [37]:
# Bring salary of people who are from 'New York'
test_df.loc[test_df.City == 'New York', 'Salary']

0    50000
Name: Salary, dtype: int64

### Selecting Data by Position <a id='3.3'></a>

In [39]:
# Another method 
test_df[test_df['City'] == 'New York']['Salary']

0    50000
Name: Salary, dtype: int64

Purely integer-location based indexing for selection by position. `.iloc[]` is primarily integer position based (from `0` to `length-1` of the axis), but may also be used with a boolean array.

Syntax: df.iloc[row_position, column_position]

In [41]:
test_df.iloc[:2, [0,1]]

    Name  Age
0  Alice   25
1    Bob   30

In [42]:
# Bring salary of people who are from 'New York'
test_df.iloc[test_df.index[test_df.City == 'New York']]

    Name  Age      City  Salary
0  Alice   25  New York   50000

### Boolean Indexing <a id='3.4'></a>

In boolean indexing, we will select subsets of data based on the actual values of the data in the DataFrame and not on their row/column labels or integer locations. In boolean indexing, we use a boolean vector to filter the data.

In [45]:
# Creating a more comprehensive sample DataFrame
test_data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Ian', 'Jack'],
    'Age': [25, 30, 35, 40, 22, 28, 34, 29, 38, 31],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia', 'San Antonio', 'San Diego', 'Dallas', 'San Jose'],
    'Salary': [70000, 80000, 120000, 90000, 65000, 72000, 85000, 78000, 95000, 91000],
    'Department': ['HR', 'Engineering', 'Marketing', 'Sales', 'Finance', 'HR', 'Engineering', 'Marketing', 'Sales', 'Finance'],
    'Years_Experience': [3, 5, 10, 12, 2, 4, 8, 6, 11, 9],
    'Manager': [False, True, True, True, False, False, True, False, True, True]
}

test_df = pd.DataFrame(test_data)

In [46]:
# Employees with a salary between 80000-90000
test_df['Salary'].between(80000, 90000)

0    False
1     True
2    False
3     True
4    False
5    False
6     True
7    False
8    False
9    False
Name: Salary, dtype: bool

In [47]:
# fetch dataframe with loc 
test_df.loc[test_df['Salary'].between(80000, 90000)]

    Name  Age         City  Salary   Department  Years_Experience  Manager
1    Bob   30  Los Angeles   80000  Engineering                 5     True
3  David   40      Houston   90000        Sales                12     True
6  Grace   34  San Antonio   85000  Engineering                 8     True

In [48]:
test_df['Salary'].isin(range(80000, 90001))

0    False
1     True
2    False
3     True
4    False
5    False
6     True
7    False
8    False
9    False
Name: Salary, dtype: bool

In [49]:
# fetch dataframe with isin 
test_df[test_df['Salary'].isin(range(80000, 90001))]

    Name  Age         City  Salary   Department  Years_Experience  Manager
1    Bob   30  Los Angeles   80000  Engineering                 5     True
3  David   40      Houston   90000        Sales                12     True
6  Grace   34  San Antonio   85000  Engineering                 8     True

In [50]:
# fetch dataframe with query
min_salary = 80000
max_salary = 90000

test_df.query('@min_salary <= Salary <= @max_salary')

    Name  Age         City  Salary   Department  Years_Experience  Manager
1    Bob   30  Los Angeles   80000  Engineering                 5     True
3  David   40      Houston   90000        Sales                12     True
6  Grace   34  San Antonio   85000  Engineering                 8     True

In [51]:
# %%timeit 
test_df[test_df['Salary'].isin(range(80000, 90001)) & test_df['Department'].isin(['Engineering'])]

    Name  Age         City  Salary   Department  Years_Experience  Manager
1    Bob   30  Los Angeles   80000  Engineering                 5     True
6  Grace   34  San Antonio   85000  Engineering                 8     True

In [52]:
# %%timeit 
test_df[(test_df['Salary'].between(80000, 90001)) & (test_df['Department'] == 'Engineering')]

    Name  Age         City  Salary   Department  Years_Experience  Manager
1    Bob   30  Los Angeles   80000  Engineering                 5     True
6  Grace   34  San Antonio   85000  Engineering                 8     True

In [53]:
# %%timeit 
test_df.loc[(test_df['Salary'].between(80000, 90001)) & (test_df['Department'] == 'Engineering')]

    Name  Age         City  Salary   Department  Years_Experience  Manager
1    Bob   30  Los Angeles   80000  Engineering                 5     True
6  Grace   34  San Antonio   85000  Engineering                 8     True

In [54]:
# %%timeit 
min_salary = 80000
max_salary = 90000
department = 'Engineering'

test_df.query('@min_salary <= Salary <= @max_salary & Department == @department')

    Name  Age         City  Salary   Department  Years_Experience  Manager
1    Bob   30  Los Angeles   80000  Engineering                 5     True
6  Grace   34  San Antonio   85000  Engineering                 8     True

### Setting and Resetting Index <a id='3.5'></a>

Set the DataFrame index using existing columns.

In [57]:
test_df = test_df.set_index('Salary').copy()
test_df.head()

           Name  Age         City   Department  Years_Experience  Manager
Salary
70000     Alice   25     New York           HR                 3    False
80000       Bob   30  Los Angeles  Engineering                 5     True
120000  Charlie   35      Chicago    Marketing                10     True
90000     David   40      Houston        Sales                12     True
65000       Eve   22      Phoenix      Finance                 2    False

In [58]:
# reset index
test_df = test_df.reset_index().copy()
test_df.head()

   Salary     Name  Age         City   Department  Years_Experience  Manager
0   70000    Alice   25     New York           HR                 3    False
1   80000      Bob   30  Los Angeles  Engineering                 5     True
2  120000  Charlie   35      Chicago    Marketing                10     True
3   90000    David   40      Houston        Sales                12     True
4   65000      Eve   22      Phoenix      Finance                 2    False

## Data Manipulation <a id='4'></a>

### Adding and Removing Columns <a id='4.1'></a>

In [61]:
# Adding new column 
test_df['Test_column'] = 'test'
test_df.head()

,Salary,Name,Age,City,Department,Years_Experience,Manager,Test_column
0,70000,Alice,25,New York,HR,3,False,test
1,80000,Bob,30,Los Angeles,Engineering,5,True,test
2,120000,Charlie,35,Chicago,Marketing,10,True,test
3,90000,David,40,Houston,Sales,12,True,test
4,65000,Eve,22,Phoenix,Finance,2,False,test

In [62]:
# Add new column according to condition ->condition: If department is Engineering the value of column True, else False
test_df['is_engineering'] = False
test_df.loc[test_df['Department'] == 'Engineering', 'is_engineering'] = True
test_df.sample(2)

,Salary,Name,Age,City,Department,Years_Experience,Manager,Test_column,is_engineering
4,65000,Eve,22,Phoenix,Finance,2,False,test,False
2,120000,Charlie,35,Chicago,Marketing,10,True,test,False

<b>Create a new column with a condition with Numpy

In [64]:
import numpy as np

In [65]:
%%timeit
test_df['salary_clustering '] = np.select(
    [
        test_df['Salary'] < 80000,
        (test_df['Salary'] >= 80000) & (test_df['Salary'] <= 100000)
    ],
    [
        'low salary',
        'normal salary'
    ],
    default='high salary'
)

266 s  7.11 s per loop (mean  std. dev. of 7 runs, 1,000 loops each)

In [66]:
test_df.head()

,Salary,Name,Age,City,Department,Years_Experience,Manager,Test_column,is_engineering,salary_clustering
0,70000,Alice,25,New York,HR,3,False,test,False,low salary
1,80000,Bob,30,Los Angeles,Engineering,5,True,test,True,normal salary
2,120000,Charlie,35,Chicago,Marketing,10,True,test,False,high salary
3,90000,David,40,Houston,Sales,12,True,test,False,normal salary
4,65000,Eve,22,Phoenix,Finance,2,False,test,False,low salary

<b>Create a new column with cut function. <a href="https://pandas.pydata.org/docs/reference/api/pandas.cut.html">Click for more information</a>

In [68]:
%%timeit
# Define the bins and corresponding labels
bins = [0, 80000, 100000, float('inf')]  # Bins for 'low salary', 'normal salary', and 'high salary'
labels = ['low salary', 'normal salary', 'high salary']

# Use pd.cut to categorize salaries and create the 'salary_clustering_with_cut' column
test_df['salary_clustering_with_cut'] = pd.cut(test_df['Salary'], bins=bins, labels=labels, right=False)

1.31 ms  146 s per loop (mean  std. dev. of 7 runs, 1,000 loops each)

In [69]:
test_df.head()

,Salary,Name,Age,City,Department,Years_Experience,Manager,Test_column,is_engineering,salary_clustering,salary_clustering_with_cut
0,70000,Alice,25,New York,HR,3,False,test,False,low salary,low salary
1,80000,Bob,30,Los Angeles,Engineering,5,True,test,True,normal salary,normal salary
2,120000,Charlie,35,Chicago,Marketing,10,True,test,False,high salary,high salary
3,90000,David,40,Houston,Sales,12,True,test,False,normal salary,normal salary
4,65000,Eve,22,Phoenix,Finance,2,False,test,False,low salary,low salary

<b>Drop specified labels from rows or columns with pd.drop() function</b> <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html">Click for more information</a>

In [71]:
# Drop Test_column in the dataset, axis=0 -> rows, axis=1 -> columns
test_df = test_df.drop('Test_column', axis=1)
test_df.head(2)

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut
0,70000,Alice,25,New York,HR,3,False,False,low salary,low salary
1,80000,Bob,30,Los Angeles,Engineering,5,True,True,normal salary,normal salary

### Renaming Columns <a id='4.2'></a>

Rename columns or index labels. <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html#">Click for more informatio</a>

`DataFrame.rename` supports two calling conventions
* (index=index_mapper, columns=columns_mapper, ...)
* (mapper, axis={'index', 'columns'}, ...)

In [74]:
test_df.rename(columns={
    "salary_clustering": "clustering_salary_with_numpy",
    "salary_clustering_with_cut": "clustering_salary_with_cut"
})

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,clustering_salary_with_cut
0,70000,Alice,25,New York,HR,3,False,False,low salary,low salary
1,80000,Bob,30,Los Angeles,Engineering,5,True,True,normal salary,normal salary
2,120000,Charlie,35,Chicago,Marketing,10,True,False,high salary,high salary
3,90000,David,40,Houston,Sales,12,True,False,normal salary,normal salary
4,65000,Eve,22,Phoenix,Finance,2,False,False,low salary,low salary
5,72000,Frank,28,Philadelphia,HR,4,False,False,low salary,low salary
6,85000,Grace,34,San Antonio,Engineering,8,True,True,normal salary,normal salary
7,78000,Hannah,29,San Diego,Marketing,6,False,False,low salary,low salary
8,95000,Ian,38,Dallas,Sales,11,True,False,normal salary,normal salary
9,91000,Jack,31,San Jose,Finance,9,True,False,normal salary,normal salary

### Handling Missing Data <a id='4.3'></a>

In Pandas missing data is represented by two value: 

* None: None is a Python singleton object that is often used for missing data in Python code.
* NaN : NaN (an acronym for Not a Number), is a special floating-point value recognized by all systems that use the standard IEEE floating-point representation

<a href="https://pandas.pydata.org/docs/user_guide/missing_data.html#">Click for more information</a>

In [77]:
# adding new futures with Null variables
test_df['Bonus'] = [7000, 11000, None, np.nan, 6000, 8500, 10000, np.nan, None, 10000]
test_df['Work_From_Home_Days'] = [1,None, 2, 3, 5, np.nan, 4, 5, 1, 2]
test_df['is_there_experience'] = ['no', 'yes', 'yes', 'yes', 'no', np.nan, 'yes', None, 'yes', 'yes']
test_df

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
0,70000,Alice,25,New York,HR,3,False,False,low salary,low salary,7000.0,1.0,no
1,80000,Bob,30,Los Angeles,Engineering,5,True,True,normal salary,normal salary,11000.0,NaN,yes
2,120000,Charlie,35,Chicago,Marketing,10,True,False,high salary,high salary,NaN,2.0,yes
3,90000,David,40,Houston,Sales,12,True,False,normal salary,normal salary,NaN,3.0,yes
4,65000,Eve,22,Phoenix,Finance,2,False,False,low salary,low salary,6000.0,5.0,no
5,72000,Frank,28,Philadelphia,HR,4,False,False,low salary,low salary,8500.0,NaN,NaN
6,85000,Grace,34,San Antonio,Engineering,8,True,True,normal salary,normal salary,10000.0,4.0,yes
7,78000,Hannah,29,San Diego,Marketing,6,False,False,low salary,low salary,NaN,5.0,None
8,95000,Ian,38,Dallas,Sales,11,True,False,normal salary,normal salary,NaN,1.0,yes
9,91000,Jack,31,San Jose,Finance,9,True,False,normal salary,normal salary,10000.0,2.0,yes

#### Detecting Missing Data<a id='4.3.1'></a>

To detect missing value, use the `isna()` or `notna()` or `isnull()` or `notnull()` methods.

<b>Note:</b><br> `isna` and `isnull`: Detect missing values, functionally equivalent.<br>
`notna` and `notnull`: Detect non-missing values, functionally equivalent.

In [80]:
# use isna()
test_df[test_df.isna().any(axis=1)]

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
1,80000,Bob,30,Los Angeles,Engineering,5,True,True,normal salary,normal salary,11000.0,NaN,yes
2,120000,Charlie,35,Chicago,Marketing,10,True,False,high salary,high salary,NaN,2.0,yes
3,90000,David,40,Houston,Sales,12,True,False,normal salary,normal salary,NaN,3.0,yes
5,72000,Frank,28,Philadelphia,HR,4,False,False,low salary,low salary,8500.0,NaN,NaN
7,78000,Hannah,29,San Diego,Marketing,6,False,False,low salary,low salary,NaN,5.0,None
8,95000,Ian,38,Dallas,Sales,11,True,False,normal salary,normal salary,NaN,1.0,yes

In [81]:
# use isnull()
test_df[test_df.isnull().any(axis=1)]

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
1,80000,Bob,30,Los Angeles,Engineering,5,True,True,normal salary,normal salary,11000.0,NaN,yes
2,120000,Charlie,35,Chicago,Marketing,10,True,False,high salary,high salary,NaN,2.0,yes
3,90000,David,40,Houston,Sales,12,True,False,normal salary,normal salary,NaN,3.0,yes
5,72000,Frank,28,Philadelphia,HR,4,False,False,low salary,low salary,8500.0,NaN,NaN
7,78000,Hannah,29,San Diego,Marketing,6,False,False,low salary,low salary,NaN,5.0,None
8,95000,Ian,38,Dallas,Sales,11,True,False,normal salary,normal salary,NaN,1.0,yes

In [82]:
# use notna()
test_df[test_df.notna().all(axis=1)]

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
0,70000,Alice,25,New York,HR,3,False,False,low salary,low salary,7000.0,1.0,no
4,65000,Eve,22,Phoenix,Finance,2,False,False,low salary,low salary,6000.0,5.0,no
6,85000,Grace,34,San Antonio,Engineering,8,True,True,normal salary,normal salary,10000.0,4.0,yes
9,91000,Jack,31,San Jose,Finance,9,True,False,normal salary,normal salary,10000.0,2.0,yes

In [83]:
# use notnull()
test_df[test_df.notnull().all(axis=1)]

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
0,70000,Alice,25,New York,HR,3,False,False,low salary,low salary,7000.0,1.0,no
4,65000,Eve,22,Phoenix,Finance,2,False,False,low salary,low salary,6000.0,5.0,no
6,85000,Grace,34,San Antonio,Engineering,8,True,True,normal salary,normal salary,10000.0,4.0,yes
9,91000,Jack,31,San Jose,Finance,9,True,False,normal salary,normal salary,10000.0,2.0,yes

In [84]:
# get dataframe of values with null in a column
test_df[test_df['is_there_experience'].isnull()]

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
5,72000,Frank,28,Philadelphia,HR,4,False,False,low salary,low salary,8500.0,NaN,NaN
7,78000,Hannah,29,San Diego,Marketing,6,False,False,low salary,low salary,NaN,5.0,None

In [85]:
test_df.isnull().sum()

Salary                        0
Name                          0
Age                           0
City                          0
Department                    0
Years_Experience              0
Manager                       0
is_engineering                0
salary_clustering             0
salary_clustering_with_cut    0
Bonus                         4
Work_From_Home_Days           2
is_there_experience           2
dtype: int64

#### Filling Missing Data<a id='4.3.2'></a>

`fillna()` replaces NA values with non-NA data.

In [88]:
test_df['Bonus'].fillna(0).head()

0     7000.0
1    11000.0
2        0.0
3        0.0
4     6000.0
Name: Bonus, dtype: float64

<b>Fill gaps forward or backward</b>

In [90]:
test_df.ffill().head()

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
0,70000,Alice,25,New York,HR,3,False,False,low salary,low salary,7000.0,1.0,no
1,80000,Bob,30,Los Angeles,Engineering,5,True,True,normal salary,normal salary,11000.0,1.0,yes
2,120000,Charlie,35,Chicago,Marketing,10,True,False,high salary,high salary,11000.0,2.0,yes
3,90000,David,40,Houston,Sales,12,True,False,normal salary,normal salary,11000.0,3.0,yes
4,65000,Eve,22,Phoenix,Finance,2,False,False,low salary,low salary,6000.0,5.0,no

In [91]:
test_df.bfill().head()

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
0,70000,Alice,25,New York,HR,3,False,False,low salary,low salary,7000.0,1.0,no
1,80000,Bob,30,Los Angeles,Engineering,5,True,True,normal salary,normal salary,11000.0,2.0,yes
2,120000,Charlie,35,Chicago,Marketing,10,True,False,high salary,high salary,6000.0,2.0,yes
3,90000,David,40,Houston,Sales,12,True,False,normal salary,normal salary,6000.0,3.0,yes
4,65000,Eve,22,Phoenix,Finance,2,False,False,low salary,low salary,6000.0,5.0,no

In [92]:
# Fill nan values with their means
test_df[['Bonus', 'Work_From_Home_Days']].fillna(test_df[['Bonus', 'Work_From_Home_Days']].mean())

     Bonus  Work_From_Home_Days
0   7000.0                1.000
1  11000.0                2.875
2   8750.0                2.000
3   8750.0                3.000
4   6000.0                5.000
5   8500.0                2.875
6  10000.0                4.000
7   8750.0                5.000
8   8750.0                1.000
9  10000.0                2.000

In [93]:
# Fill nan values with interpolate
test_df[['Bonus', 'Work_From_Home_Days']].interpolate()

          Bonus  Work_From_Home_Days
0   7000.000000                  1.0
1  11000.000000                  1.5
2   9333.333333                  2.0
3   7666.666667                  3.0
4   6000.000000                  5.0
5   8500.000000                  4.5
6  10000.000000                  4.0
7  10000.000000                  5.0
8  10000.000000                  1.0
9  10000.000000                  2.0

In [94]:
# Fill NaN values with the mode value in a categorical column
# test_df['is_there_experience'].mode()[0]
test_df["is_there_experience"].fillna(test_df['is_there_experience'].mode()[0])

0     no
1    yes
2    yes
3    yes
4     no
5    yes
6    yes
7    yes
8    yes
9    yes
Name: is_there_experience, dtype: object

#### Dropping Missing Data<a id='4.3.3'></a>

`dropna()` dropn rows or columns with missing data.

In [97]:
test_df.dropna()

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
0,70000,Alice,25,New York,HR,3,False,False,low salary,low salary,7000.0,1.0,no
4,65000,Eve,22,Phoenix,Finance,2,False,False,low salary,low salary,6000.0,5.0,no
6,85000,Grace,34,San Antonio,Engineering,8,True,True,normal salary,normal salary,10000.0,4.0,yes
9,91000,Jack,31,San Jose,Finance,9,True,False,normal salary,normal salary,10000.0,2.0,yes

### Handling Duplicates <a id='4.4'></a>

In [99]:
# Add dublicate variables
test_df.loc[len(test_df)] = [70000, 'Alice', 25, 'New York', 'HR', 3, False, False, 'low salary', 'low salary', 7000.0, 1.0, 'no']
test_df.loc[len(test_df)] = [80000, 'Bob', 30, 'Los Angeles', 'Engineering', 5, True, True,'normal salary', 'normal salary', 11000.0, np.nan, 'yes']

In [100]:
# detetection duplicate rows
test_df[test_df.duplicated()]

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
10,70000,Alice,25,New York,HR,3,False,False,low salary,low salary,7000.0,1.0,no
11,80000,Bob,30,Los Angeles,Engineering,5,True,True,normal salary,normal salary,11000.0,NaN,yes

In [101]:
# Drop dublicated rows with loc()
test_df.loc[~test_df.duplicated()].tail()

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
5,72000,Frank,28,Philadelphia,HR,4,False,False,low salary,low salary,8500.0,NaN,NaN
6,85000,Grace,34,San Antonio,Engineering,8,True,True,normal salary,normal salary,10000.0,4.0,yes
7,78000,Hannah,29,San Diego,Marketing,6,False,False,low salary,low salary,NaN,5.0,None
8,95000,Ian,38,Dallas,Sales,11,True,False,normal salary,normal salary,NaN,1.0,yes
9,91000,Jack,31,San Jose,Finance,9,True,False,normal salary,normal salary,10000.0,2.0,yes

In [102]:
# Drop dublicated rows with drop_duplicates()
test_df.drop_duplicates().tail()

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
5,72000,Frank,28,Philadelphia,HR,4,False,False,low salary,low salary,8500.0,NaN,NaN
6,85000,Grace,34,San Antonio,Engineering,8,True,True,normal salary,normal salary,10000.0,4.0,yes
7,78000,Hannah,29,San Diego,Marketing,6,False,False,low salary,low salary,NaN,5.0,None
8,95000,Ian,38,Dallas,Sales,11,True,False,normal salary,normal salary,NaN,1.0,yes
9,91000,Jack,31,San Jose,Finance,9,True,False,normal salary,normal salary,10000.0,2.0,yes

To remove duplicates on specific column(s), use `subset`

In [104]:
test_df.drop_duplicates(subset='Name').tail()

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
5,72000,Frank,28,Philadelphia,HR,4,False,False,low salary,low salary,8500.0,NaN,NaN
6,85000,Grace,34,San Antonio,Engineering,8,True,True,normal salary,normal salary,10000.0,4.0,yes
7,78000,Hannah,29,San Diego,Marketing,6,False,False,low salary,low salary,NaN,5.0,None
8,95000,Ian,38,Dallas,Sales,11,True,False,normal salary,normal salary,NaN,1.0,yes
9,91000,Jack,31,San Jose,Finance,9,True,False,normal salary,normal salary,10000.0,2.0,yes

To remove duplicates and keep last occurrences, use `keep`

In [106]:
test_df.drop_duplicates(subset=['Name', 'Salary'], keep='last')

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
2,120000,Charlie,35,Chicago,Marketing,10,True,False,high salary,high salary,NaN,2.0,yes
3,90000,David,40,Houston,Sales,12,True,False,normal salary,normal salary,NaN,3.0,yes
4,65000,Eve,22,Phoenix,Finance,2,False,False,low salary,low salary,6000.0,5.0,no
5,72000,Frank,28,Philadelphia,HR,4,False,False,low salary,low salary,8500.0,NaN,NaN
6,85000,Grace,34,San Antonio,Engineering,8,True,True,normal salary,normal salary,10000.0,4.0,yes
7,78000,Hannah,29,San Diego,Marketing,6,False,False,low salary,low salary,NaN,5.0,None
8,95000,Ian,38,Dallas,Sales,11,True,False,normal salary,normal salary,NaN,1.0,yes
9,91000,Jack,31,San Jose,Finance,9,True,False,normal salary,normal salary,10000.0,2.0,yes
10,70000,Alice,25,New York,HR,3,False,False,low salary,low salary,7000.0,1.0,no
11,80000,Bob,30,Los Angeles,Engineering,5,True,True,normal salary,normal salary,11000.0,NaN,yes

<a href="https://pandas.pydata.org/docs/user_guide/duplicates.html#duplicate-label-detection">Click for more information about duplicate values</a>

### Replacing Values <a id='4.5'></a>

Pandas dataframe.replace() function is used to replace a string, regex, list, dictionary, series, number, etc. from a Pandas Dataframe in Python. Every instance of the provided value is replaced after a thorough search of the full DataFrame.

Syntax: DataFrame.replace(to_replace=None, value=_NoDefault.no_default, *, inplace=False, limit=None, regex=False, method=_NoDefault.no_default)

In [110]:
# Change HR to Human Resources in the Department column
test_df.replace({'Department': {'HR': 'Human Resources'}}).head()
# test_df['Department'] = test_df['Department'].replace(to_replace= 'Human Resources' , value='HR')

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience
0,70000,Alice,25,New York,Human Resources,3,False,False,low salary,low salary,7000.0,1.0,no
1,80000,Bob,30,Los Angeles,Engineering,5,True,True,normal salary,normal salary,11000.0,NaN,yes
2,120000,Charlie,35,Chicago,Marketing,10,True,False,high salary,high salary,NaN,2.0,yes
3,90000,David,40,Houston,Sales,12,True,False,normal salary,normal salary,NaN,3.0,yes
4,65000,Eve,22,Phoenix,Finance,2,False,False,low salary,low salary,6000.0,5.0,no

<a href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.replace.html#">Click for more information about Replacing values</a>

### Unique Values <a id='4.6'></a>

The `unique()` function removes all duplicate values on a column and returns a single value for multiple same values. In this article, we will discuss how we can get unique values from a column in Pandas DataFrame. Return unique values of Series object.

In [114]:
test_df.Name.unique()

array(['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace',
       'Hannah', 'Ian', 'Jack'], dtype=object)

In [115]:
# Return number of unique elements in the object.
test_df.Name.nunique()

10

### Value Counts <a id='4.7'></a>

Pandas `Index.value_counts()` function returns object containing counts of unique values. The resulting object will be in descending order so that the first element is the most frequently-occurring element. Excludes NA values by default.

In [118]:
test_df[['Name','City']].value_counts(ascending=False)

Name     City
Alice    New York        2
Bob      Los Angeles     2
Charlie  Chicago         1
David    Houston         1
Eve      Phoenix         1
Frank    Philadelphia    1
Grace    San Antonio     1
Hannah   San Diego       1
Ian      Dallas          1
Jack     San Jose        1
Name: count, dtype: int64

## Data Operations <a id='5'></a>

### Descriptive Statistics <a id='5.1'></a>

Understanding data using <strong>.describe()</strong><br> The .describe() method prints the summary statistics of all numeric columns, such as count, mean, standard deviation, range, and quartiles of numeric columns.

In [122]:
test_df.describe().T

,count,mean,std,min,25%,50%,75%,max
Salary,12.0,83000.000000,14942.313317,65000.0,71500.00,80000.0,90250.00,120000.0
Age,12.0,30.583333,5.401319,22.0,27.25,30.0,34.25,40.0
Years_Experience,12.0,6.500000,3.397860,2.0,3.75,5.5,9.25,12.0
Bonus,8.0,8812.500000,1962.824132,6000.0,7000.00,9250.0,10250.00,11000.0
Work_From_Home_Days,9.0,2.666667,1.658312,1.0,1.00,2.0,4.00,5.0

In [123]:
# Find mean, sum, min-max and count of a future
test_df.Salary.mean(), test_df.Salary.sum(), test_df.Salary.min(), test_df.Salary.max(), test_df.Salary.count()

(83000.0, 996000, 65000, 120000, 12)

### Applying Functions <a id='5.2'></a>

The `apply` function in pandas is a versatile tool that allows you to apply a function along either axis (rows or columns) of a DataFrame. This can be very powerful for performing complex transformations and computations that involve multiple columns or rows.

Assume we want to find out the promotion eligibility of employees based on some conditions. It's possible to create a new column with apply function..

In [127]:
%%timeit
# With lambda func.
test_df['promotion_eligibility_with_lambda'] = test_df.apply(
    lambda row: 'Eligible' if row['Age'] > 30 and row['Years_Experience'] > 10 and row['Manager'] else 'Not Eligible',
    axis=1
)
test_df.head(4)

955 s  127 s per loop (mean  std. dev. of 7 runs, 1,000 loops each)

In [128]:
%%timeit
# without lambda function
def is_eligible_for_promotion(row):
    if  row['Age'] > 30 and row['Years_Experience'] > 10 and row['Manager']:
        return "Eligible"
    else:
        return "Not Eligible"

test_df['promotion_eligibility_with_func'] = test_df.apply(is_eligible_for_promotion, axis=1)

981 s  101 s per loop (mean  std. dev. of 7 runs, 1,000 loops each)

The `.map()` function in pandas is used for element-wise transformations of a Series. It is often used to apply a function or a dictionary to transform the values in a Series. The .map() method can be particularly useful for transforming categorical data or for applying a function to each element of a Series.

In [130]:
# Find the short version of Emplooyes' genders. First add genders
gender_map = {
    'Alice': 'Female',
    'Bob': 'Male',
    'Charlie': 'Male',
    'David': 'Male',
    'Eve': 'Female',
    'Frank': 'Male',
    'Grace': 'Female',
    'Hannah': 'Female',
    'Ian': 'Male',
    'Jack': 'Male'
}

# Map the gender to the 'Gender' column
test_df['Gender'] = test_df['Name'].map(gender_map)

In [131]:
%%timeit
test_df['short_version_of_gender'] = test_df['Gender'].map(lambda x: 'M' if x == 'Male' else 'F')

249 s  21.4 s per loop (mean  std. dev. of 7 runs, 1,000 loops each)

In [132]:
test_df.head(2)

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience,promotion_eligibility_with_lambda,promotion_eligibility_with_func,Gender,short_version_of_gender
0,70000,Alice,25,New York,HR,3,False,False,low salary,low salary,7000.0,1.0,no,Not Eligible,Not Eligible,Female,F
1,80000,Bob,30,Los Angeles,Engineering,5,True,True,normal salary,normal salary,11000.0,NaN,yes,Not Eligible,Not Eligible,Male,M

### Sorting and Ranking <a id='5.3'></a>

The `sort_values()` method sorts the DataFrame by the specified label.

* Syntax: dataframe.sort_values(by, axis, ascending, inplace, kind, na_position, ignore_index, key)

In [135]:
test_df.sort_values("City").head(3)

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience,promotion_eligibility_with_lambda,promotion_eligibility_with_func,Gender,short_version_of_gender
2,120000,Charlie,35,Chicago,Marketing,10,True,False,high salary,high salary,NaN,2.0,yes,Not Eligible,Not Eligible,Male,M
8,95000,Ian,38,Dallas,Sales,11,True,False,normal salary,normal salary,NaN,1.0,yes,Eligible,Eligible,Male,M
3,90000,David,40,Houston,Sales,12,True,False,normal salary,normal salary,NaN,3.0,yes,Eligible,Eligible,Male,M

In [136]:
test_df.sort_values(by = ["Bonus"], ascending=False, na_position='first')[['Bonus']]

      Bonus
2       NaN
3       NaN
7       NaN
8       NaN
1   11000.0
11  11000.0
6   10000.0
9   10000.0
5    8500.0
0    7000.0
10   7000.0
4    6000.0

To rank the rows of Pandas DataFrame we can use the DataFrame.rank() method which returns a rank of every respective index of a series passed. The rank is returned on the basis of position after sorting.

In [138]:
test_df.Salary.rank(method='min')

0      2.0
1      6.0
2     12.0
3      9.0
4      1.0
5      4.0
6      8.0
7      5.0
8     11.0
9     10.0
10     2.0
11     6.0
Name: Salary, dtype: float64

### Grouping Data <a id='5.4'></a>

#### GroupBy <a id='5.4.1'></a>

Pandas `dataframe.groupby()` function is used to split the data into groups based on some criteria. Pandas objects can be split on any of their axes. The abstract definition of grouping is to provide a mapping of labels to group names.

In [142]:
test_df.groupby(['Department', 'Manager']).count()[['Salary']].reset_index()

    Department  Manager  Salary
0  Engineering     True       3
1      Finance    False       1
2      Finance     True       1
3           HR    False       3
4    Marketing    False       1
5    Marketing     True       1
6        Sales     True       2

In [143]:
test_df.groupby('Department')['Salary'].apply(lambda x: x.max() - x.min())

Department
Engineering     5000
Finance        26000
HR              2000
Marketing      42000
Sales           5000
Name: Salary, dtype: int64

#### Aggregation <a id='5.4.2'></a>

`Dataframe.aggregate()` function is used to apply some aggregation across one or more columns.

In [146]:
# We are going to find aggregation for these columns 
test_df.aggregate({"Age":['max', 'min', 'mean'], 
              "Years_Experience":['min','max', 'sum', 'mean'],  
              "Salary":['sum']})

            Age  Years_Experience    Salary
max   40.000000              12.0       NaN
min   22.000000               2.0       NaN
mean  30.583333               6.5       NaN
sum         NaN              78.0  996000.0

In [147]:
# Group by Department and calculate average salary and maximum age
test_df.groupby('Department').agg({
    'Salary': 'mean',    # Calculate mean salary
    'Age': 'max',         # Calculate maximum age
    'Name': 'count'     # Calculate count of  employees -> size or count
})

                   Salary  Age  Name
Department
Engineering  81666.666667   34     3
Finance      78000.000000   31     2
HR           70666.666667   28     3
Marketing    99000.000000   35     2
Sales        92500.000000   40     2

#### Transformation <a id='5.4.3'></a>

The `transform()` method allows you to execute a function for each value of the DataFrame.

* Syntax: dataframe.transform(func, axis, raw, result_type, args, kwds)

In [150]:
# Find rate of Salar
test_df.Salary.transform(lambda x: x / sum(test_df.Salary) * 100)

0      7.028112
1      8.032129
2     12.048193
3      9.036145
4      6.526104
5      7.228916
6      8.534137
7      7.831325
8      9.538153
9      9.136546
10     7.028112
11     8.032129
Name: Salary, dtype: float64

In [151]:
test_df.groupby("Department")[['Salary', 'Years_Experience']].transform('mean').head()

         Salary  Years_Experience
0  70666.666667          3.333333
1  81666.666667          6.000000
2  99000.000000          8.000000
3  92500.000000         11.500000
4  78000.000000          5.500000

#### Filtering <a id='5.4.4'></a>

The `filter()` method filters the DataFrame, and returns only the rows or columns that are specified in the filter.
* Syntax: dataframe.filter(items, like, regex, axis)

In [154]:
test_df.filter(items=['Name', 'Department']).head()

      Name   Department
0    Alice           HR
1      Bob  Engineering
2  Charlie    Marketing
3    David        Sales
4      Eve      Finance

## Data Cleaning and Preparation <a id="6"></a>

### Handling Different Data Types  <a id='6.1'>

The `astype()` method returns a new DataFrame where the data types has been changed to the specified type.

It is possible to find the desired column types either with the `df.dtypes.items()` loop or with the `select_dtypes()` function.

In [158]:
_test_df = test_df.copy()
_test_df.dtypes

Salary                                 int64
Name                                  object
Age                                    int64
City                                  object
Department                            object
Years_Experience                       int64
Manager                                 bool
is_engineering                          bool
salary_clustering                     object
salary_clustering_with_cut            object
Bonus                                float64
Work_From_Home_Days                  float64
is_there_experience                   object
promotion_eligibility_with_lambda     object
promotion_eligibility_with_func       object
Gender                                object
short_version_of_gender               object
dtype: object

In [159]:
# Convert object type to category

# Add columns with column type Object to a list
# object_columns = [colname for colname, coltype in _test_df.dtypes.items() if coltype == 'object']
object_columns = test_df.select_dtypes(include='object').columns.to_list()

# Change the types of the desired columns
for col in object_columns:
    _test_df[col] = _test_df[col].astype('category')

_test_df.dtypes

Salary                                  int64
Name                                 category
Age                                     int64
City                                 category
Department                           category
Years_Experience                        int64
Manager                                  bool
is_engineering                           bool
salary_clustering                    category
salary_clustering_with_cut           category
Bonus                                 float64
Work_From_Home_Days                   float64
is_there_experience                  category
promotion_eligibility_with_lambda    category
promotion_eligibility_with_func      category
Gender                               category
short_version_of_gender              category
dtype: object

### Working with Dates and Times <a id='6.2'>

The `to_datetime()` method in Pandas is used to convert various types of date formats into a standardized datetime format. <a href="https://www.programiz.com/python-programming/pandas/methods/to_datetime"> Click for more examples </a>

In [162]:
pd.to_datetime(pd.Series(['20201010', '20201111', '20201212']))

0   2020-10-10
1   2020-11-11
2   2020-12-12
dtype: datetime64[ns]

In [163]:
date_series = pd.Series(['20200101', 'invalid date', '20200301', 'another invalid'])
pd.to_datetime(date_series, format='%Y%m%d', errors='coerce')

0   2020-01-01
1          NaT
2   2020-03-01
3          NaT
dtype: datetime64[ns]

In [164]:
# Generate random columns of datetime types
random_dates = pd.date_range(start=pd.to_datetime('2015-01-01'), end=pd.to_datetime('2018-01-01'), periods=len(test_df))
test_df['random_date'] = random_dates
test_df.head(2)

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,Bonus,Work_From_Home_Days,is_there_experience,promotion_eligibility_with_lambda,promotion_eligibility_with_func,Gender,short_version_of_gender,random_date
0,70000,Alice,25,New York,HR,3,False,False,low salary,low salary,7000.0,1.0,no,Not Eligible,Not Eligible,Female,F,2015-01-01 00:00:00.000000000
1,80000,Bob,30,Los Angeles,Engineering,5,True,True,normal salary,normal salary,11000.0,NaN,yes,Not Eligible,Not Eligible,Male,M,2015-04-10 15:16:21.818181818

Work with `.dt` accessor

In [166]:
# Change the format of 'date' column to '%Y-%m-%d %H:%M:%S'
test_df['formatted_date'] = pd.to_datetime(test_df['random_date'].dt.strftime("%Y-%m-%d %H:%M:%S"))

# Add hour, day, month, quarter and year
test_df['year'] = test_df['formatted_date'].dt.year
test_df['quarter'] = test_df['formatted_date'].dt.quarter
test_df['month'] = test_df['formatted_date'].dt.month
test_df['day'] = test_df['formatted_date'].dt.day
test_df['hour'] = test_df['formatted_date'].dt.hour
test_df.head(2)

,Salary,Name,Age,City,Department,Years_Experience,Manager,is_engineering,salary_clustering,salary_clustering_with_cut,...,promotion_eligibility_with_func,Gender,short_version_of_gender,random_date,formatted_date,year,quarter,month,day,hour
0,70000,Alice,25,New York,HR,3,False,False,low salary,low salary,...,Not Eligible,Female,F,2015-01-01 00:00:00.000000000,2015-01-01 00:00:00,2015,1,1,1,0
1,80000,Bob,30,Los Angeles,Engineering,5,True,True,normal salary,normal salary,...,Not Eligible,Male,M,2015-04-10 15:16:21.818181818,2015-04-10 15:16:21,2015,2,4,10,15

### String Manipulation <a id='6.3'>

Pandas provides a wide range of string manipulation methods that are useful for data cleaning and preprocessing. These methods are available through the `.str` accessor, which you can use on a Pandas Series containing string data.

In [169]:
test_df['name_lower'] = test_df['Name'].str.lower()
test_df['name_upper'] = test_df['Name'].str.upper()
test_df['Department'] = test_df['Department'].str.replace('Finance', 'Financial Services')
test_df['contains_hr'] = test_df['Department'].str.contains('HR')  #Check if the 'Department' column contains 'HR'
# test_df['salary_clustering_with_cut'].str.split().str[0]
# test_df['City'].str.findall("o")
# test_df['City'].str.get(0)

## Combining Data <a id="7"></a>

### Merging DataFrames <a id='7.1'>

#### Inner Join <a id='7.1.1'>